#include <iostream>
#include <cstring>

using namespace std;

long long dp[201][201]; // k개를 사용하여 n을 만드는 경우의 수

int main(){
    memset(dp, 0, sizeof(dp));
    int n, k;
    cin >> n >> k;

    for(int i=0; i<=n; i++){
        dp[1][i] = 1;
    } // 어떤 수 1개를 더해서 n이 되는 경우는 단 하나

    for(int i=2; i<=k; i++){
        for(int j=0; j<=n; j++){
            for(int k=0; k<=j; k++){
                dp[i][j] += dp[i-1][k];
            }
            dp[i][j] = dp[i][j] % 1000000000;
        }
    }

    cout << dp[k][n]<< '\n';
    return 0;
}

/**
 * n,0 - 1개
 * 
 * 1,1 - 1 1개
 * 2,1 - 1,0 / 0,1 2개
 * 3,1 - 1,0,0 / 0,1,0 / 0,0,1 3개
 * 4,1 - 1,0,0,0 / 0,1,0,0 / 0,0,1,0 / 0,0,0,1 4개
 * 
 * 1,2 - 2 - 1개
 * 2,2 - 2,0 / 0,2 / 1,1 - 3개
 * 3,2 - 2,0,0 / 0,2,0 / 0,0,2 / 1,1,0 / 1,0,1 / 0,1,1 - 6개
 * 4,2 - 2,0,0,0 / 0,2,0,0 / 0,0,2,0 / 0,0,0,2 / 외 6개 - 10개
 * 
 * 1,3 - 3 1개
 * 2,3 - 3,0 / 0,3 / 2,1, / 1,2 (4)
 * 3,3 - 3,0,0 / 0,3,0 / 0,0,3 / 2,1,0 / 2,0,1 / 1,2,0 / 1,0,2 / 0,1,2 / 0,2,1 
 * 4,3 - 
 * 
 * 결론: dp[k][n] = dp[k-1][0] + dp[k-1][1] + ... dp[k-1][n]
*/